rails/app/controllers/api/v1/current/articles_controller.rb

SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = 1 AND `articles`.`id` = 32 LIMIT 1
---
  def show
    article = current_user.articles.find(params[:id])

INSERT INTO `articles` (`title`, `content`, `status`, `user_id`, `created_at`, `updated_at`) VALUES (NULL, NULL, 10, 1, '2024-08-01 05:51:34.702523', '2024-08-01 05:51:34.702523')
SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = 1 AND `articles`.`status` = 10 ORDER BY `articles`.`id` ASC LIMIT 1
---
  def create
    unsaved_article = current_user.articles.unsaved.first || current_user.articles.create!(status: :unsaved)

SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = 1 AND `articles`.`id` = 32 LIMIT 1
UPDATE `articles` SET `articles`.`content` = '# h1タグ\n\nテスト\n\n## h2タグ\n\nテスト', `articles`.`status` = 30, `articles`.`updated_at` = '2024-08-01 05:54:29.556526' WHERE `articles`.`id` = 32
---
  def update
    article = current_user.articles.find(params[:id])
    article.update!(article_params)